Repository: Habibakhali/AQUA
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Back
ar: رجوع

# cs_title
source: Computer Science
ar: علوم الحاسب

# math_title
source: Pure Math
ar: رياضيات بحتة

# statistic_title
source: Statistic
ar: إحصاء

# statisticmath_title
source: Statistic&Math
ar: إحصاء ورياضيات البحتة

# statisticcs_title
source: Statistic&Computer Science
ar: إحصاء وعلوم الحاسب

# mathcs_title
source: Math&Computer Science
ar: رياضيات البحتة وعلوم الحاسب

# qa
source: Quality assurance Unit Ain Shams University
ar: وحدة هئية الجودة جامعة عين شمس

# student_login
source: Student
ar: طالب

# doctor_login
source: Doctor & Assistant
ar: دكتور ومساعدين

# qa_login
source: Quality Assurance
ar: هيئة الجودة

# graduated_login
source: Graduated
ar: خريج

# email_label
source: Email
ar: البريد الإلكتروني

# password_label
source: Password
ar: كلمة السر

# confirm_label
source: Confirm
ar: تأكيد

# new_password
source: Create new password
ar: إنشاء كلمة سر جديدة

source: Log in
ar: تسجيل الدخول

# forget_password
source: Forget My Password?
ar: نسيت كلمة المرور الخاطة بي؟

# new_account
source: Create New Account
ar: إنشاء حساب جديد

source: Academic Register
ar: السجل الأكاديمي

source: Registration Form
ar: إستمارة التسجيل

# courses_title
source: Courses
ar: المقرر التعليمي

source: Setting
ar: الإعدادات

source: Verify
ar: تحقق

# resend_code
source: Resend new code
ar: إعادة إرسال رمز جديد

source: Verification Code
ar: رمز التحقق

# sending_to_email
source: We have send the code verification to
ar: لقد أرسلنا رمز التحقق إلى

# didnt_recirve
source: Didn't you recieve any code?
ar: ألم تستلم أي كود؟

# note_new_password
source: Your password must be different from previous used password.
ar: يجب أن تكون كلمة المرور الخاصة بك مختلفة عن كلمة المرور السابقة المستخدمة.

# password_letter
source: Must be have characters
ar: يجب أن يحتوي على أحرف

# password_lettertwo
source: Both passwords must match
ar: يجب أن تتطابق كلمتا المرور

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: User name
ar: اسم المستخدم

# user_name_hint
source: Enter Your name
ar: أدخل إسمك

# email_hint
source: Enter Your Email
ar: أدخل بريدك الإلكتروني

# phone_hint
source: Enter Your Phone
ar: أدخل هاتفك

# id_hint
source: Enter Your National ID
ar: أدخل الرقم القومي الخاص بك

# password_hint
source: Enter Your Password
ar: ادخل رقمك السري

# confirm_hint
source: Enter same new password
ar: أدخل نفس كلمة المرور الجديدة

# level_hint
source: Enter your Acadymic Year
ar: أدخل عامك الأكاديمي

source: Register
ar: تسجل

source: University email
ar: البريد الإلكتروني الجامعي

# phone
source: Phone Number
ar: رقم الهاتف

# id
source: National ID
ar: الرقم القومي

# level
source: Acadymic Year
ar: عامك الأكاديمي

source: Language
ar: اللغة

# englishLang
source: English
ar: الإنجليزية

# arabicLang
source: Arabic
ar: العربية

source: Theme
ar: المظهر

# lightMode
source: Light
ar: فاتح

# dartMode
source: Dark
ar: داكن

# no_img
source: No image selected
ar: لم يتم اختيار أي صورة

# capture_img
source: Choose Image From Camera
ar: اختر صورة من الكاميرا

source: OR
ar: أو

# gallery_img
source: Choose Image From Gallery
ar: اختر صورة من المعرض

# upload_img
source: Upload image
ar: تحميل الصور

source: Hi,
ar: اهلاً,

source: Welcome
ar: مرحبا

source: Find your course..
ar: ابحث عن مقررك التعليمي ..

# choose_course
source: choose your course
ar: اختر مقررك التعليمي

source: Parallel
ar: المعالجة المتوازية والموزعة

# image_process
source: Image Processing
ar: معالجة الصور

# ai
source: Artificial Intelligence
ar: الذكاء الاصطناعي

source: Project A
ar: مشروع أ

# security
source: Cyber Security
ar: أمن الشبكات

# geomety
source: Computational Geometric
ar: الهندسة الحسابية

# activity
source: Student Activity
ar: الأنشطة الطلابية

source: Ranger
ar: جوالة

source: Stage
ar: مسرح

# singing
source: Choral
ar: كورال

source: Sports
ar: رياضة

source: Drawing
ar: رسم

# ranger_description
source: It is a stage of the scout movement whose motto is public service and community development
ar: هي مرحلة من مراحل الحركة الكشفية شعارها خدمة عامة وتنمية مجتمع

# stage_description
source: It is an artistic phenomenon based on a conscious and intentional encounter between the actor and the viewer
ar: هي ظاهرة فنيّة قائمة في أساسها على لقاء واعٍ ومقصود بين الممثل والمُشاهِد

# singe_description
source: It is a musical group consisting of singers, who perform choral music
ar: هي مجموعة موسيقية تتألف من مغنين، يؤدون موسيقا كورالية

# sport_description
source: It is a group of sports such as football and table tennis
ar: هي مجموعة من الالعاب الرياضية مثل كرة القدم وتنس الطاولة

# drawing_description
source: It is a group of artists with artistic talent
ar: هي مجموعة فنانين يمتلكون موهبة فنية

# prof_name
source: Full Name
ar: الاسم بالكامل

# hint_prof_name
source: User Name
ar: إسم المستخدم

source: Location
ar: الموقع

# address
source: Cairo,Egypt
ar: القاهرة,مصر

# address_label
source: Address
ar: العنوان

# address_hint
source: Enter your address
ar: ادخل عنوانك

# grad_batch
source: Graduation Batch
ar: دفعة التخرج

# grad_baatch_hint
source: Enter your Graduation Batch
ar: ادخل دفعة التخرجك

source: Scientific Degree
ar: الدرجة العلمية

# scientific_degree_hint
source: Enter your Scientific Degree
ar: ادخل درجتك العلمية

# garduation_certification
source: Certificate
ar: شهادة التخرج

source: Birth Date
ar: تاريخ الميلاد

source: Select
ar: اختر

source: Select semester
ar: حدد الفصل الدراسي

# exam
source: Exams
ar: الامتحانات

source: Semester 1
ar: الفصل الدراسي الاول

source: Current Job
ar: الوظيفة الحالية

# hint_current_job
source: Enter your current job
ar: ادخل الوظيفة الحالية

source: Last Job
ar: الوظيفة السابقة

# hint_last_job
source: Enter your Last job
ar: ادخل الوظيفة السابقه

source: Employer
ar: جهة العمل

# hint_employer
source: Enter your employer
ar: ادخل جهة العمل

# worked
source: Work
ar: يعمل

source: Semester 2
ar: الفصل الدراسي التاني

# select_year
source: Select a Year
ar: اختر السنة

# validation_cv
source: please upload your cv
ar: رجاء ارفع سيرتك الذاتية

# questioner
source: Questionnaire
ar: نموذج الإستطلاع

# q1
source: Course objectives are stated at the beginning of the semester
ar: تم توضيح أهداف المقرر في بداية الفصل الدراسي

# q2
source: The course objectives have been achieved at the end of the semester
ar: تحققت أهداف المقرر في نهاية الفصل الدراسي

# q3
source: I use the lecture as a primary source for memorization in any of its forms (live broadcast, online, etc.)
ar: أستعين بالمحاضرة كمصدر أساسي في الإستذكار في اي من صورها (بث مباشر ـ أون لاين ... إلخ)

# q4
source: Availability of lectures (theoretical/practical) in an effective electronic format that achieves the objectives of the course
ar: توافر المحاضرات (نظريا / عمليا) بصورة إلكترونية فاعلة ومحققة لأهداف المقرر

# q5
source: Course topics are presented in a logical manner
ar: تم عرض موضوعات المقرر على نحو منطقي سليم

# q6
source: The content of the course is consistent with the purpose of its study
ar: يتلاءم محتوى المقرر مع الهدف من دراسته

# q7
source: The amount of academic content of the course is commensurate with the time period for studying it
ar: يتناسب كم المحتوى الدارسي للمقرر مع المدة الزمنية لدراسته

# q8
source: The scientific content of the course includes useful aspects of life
ar: المحتوى العلمي للمقرر يتضمن جوانب مفيدة للحياة

# q9
source: Course topics contribute to preparing the student for work
ar: تسهم موضوعات المقرر في إعداد الطالب للعمل

# q10
source: There are multiple reference sources for the course content (university textbook, references, websites, the Egyptian Knowledge Bank, etc.).
ar: توجد مصادر مرجعية متعددة لمحتوى المقرر (الكتاب الجامعي ـ مراجع ـ مواقع ـ بنك المعرفة المصري ... إلخ

# q11
source: Teaching methods contribute to the development of students' self-learning skills
ar: تسهم طرق التدريس في تنمية مهارات الطالب في التعلم الذاتي

# q12
source: The teaching methods used help in acquiring thinking and creativity skills
ar: طرق التدريس المستخدمة تساعد على إكتساب مهارات التفكير والإبداع

# q13
source: Appropriate and effective audio-visual aids and aids are used during teaching
ar: تستخدم وسائل ومعينات سمعية وبصرية ملائمة وفعالة أثناء التدريس

# q14
source: Course contents are covered in the time allotted for the educational process
ar: يتم تغطية محتويات المقرر في الوقت المخصص للعملية التعليمية

# q15
source: Teaching staff are obligated to be present at the announced dates through (video conference) or through electronic communication
ar: يلتزم القائمون بالتدريس بالتواجد في المواعيد المعلنة من خلال (فيديو كونفرانس) أو من خلال التواصل الإلكتروني

# q16
source: The lecturer uses discussion and dialogue with the students in the period available for the lecture
ar: يستخدم المحاضر المناقشة والحوار مع الطلاب في الفترة المتاحة للمحاضرة

# q17
source: The lecturer incorporates real life examples and applications into the course content
ar: يدمج المحاضر أمثلة وتطبيقات حياتية مع محتوى المقرر

# q18
source: The lecturer communicates well with his students through communication platforms
ar: يتواصل المحاضر مع طلابه على نحو جيد من خلال منصات التواصل

# q19
source: The lecturer treats the student with respect
ar: يتعامل المحاضر بإحترام مع الطالب

# q20
source: The teacher can be approached through office hours or electronic communication
ar: يمكن اللجوء للقائم بالتدريس من خلال الساعات المكتبية أو التواصل الإلكتروني

# q21
source: I would like to study another course with the same professor
ar: أرغب بدراسة مقرر دراسي آخر مع نفس الأستاذ

# q22
source: A member of the supporting staff (demonstrating teacher - assistant teacher) treats us with respect
ar: عضو الهيئة المعاونة (معيد ـ مدرس مساعد) يتعامل معنا بإحترام

# q23
source: A faculty member who is proficient in the scientific subject
ar: عضو هيئة التدريس متمكن من المادة العلمية

# q24
source: A faculty member provides necessary assistance to the student
ar: عضو هيئة التدريس يقدم العون للازم للطالب

# q25
source: The laboratories have the capabilities and equipment necessary to learn professional and scientific skills
ar: تتوافر بالمعامل الإمكانات والتجهيزات اللازمة لتعلم المهارات المهنية والعلمية

# q26
source: The content of the practical part of the course is related to the basic scientific applications of the theoretical aspects of the course
ar: يرتبط محتوى الجزء العملي من المقرر بالتطبيقات العلمية الأساسية للجوانب النظرية للمقرر

# q27
source: Those who teach the practical part are committed to using scientific explanation from effective models and materials
ar: يلتزم القائمون بتدريس الجزء العملي بإستخدام الإيضاح العلمي من نماذج ومواد فعالة

source: CANCEL
ar: إلغاء

source: Totally disagree
ar: غير موافق تماما

source: Not agree
ar: غير موافق

source: To some extent
ar: الي حد ما

source: Totally ok
ar: موافق تماما

source: Question
ar: السؤال

source: please enter
ar: الرجاء إدخال

# not_found_search
source: No result found, please try different keyword
ar: لم يتم العثور على نتائج، يرجى محاولة استخدام كلمة رئيسية مختلفة

source: CV
ar: السيرة الذاتية

# validation_phone
source: phone number must be 11 digit
ar: يجب أن يتكون رقم الهاتف من 11 رقمًا

# validation_id
source: must be 14 digit
ar: يجب أن يكون 14 رقمًا

source: invalid
ar: غير صالحة

source: Next
ar: التالي

source: Submit
ar: إرسال

source: Your Subject
ar: موادك الدراسية

# requ_question
source: *This question is required!
ar: * هذا السؤال مطلوب!

# validation_otp
source: enter number
ar: ادخل الرقم

source: SAVE
ar: حفظ

# dialog_sucesse
source: Profile has been edited sucessfully
ar: تم تعديل الملف الشخصي بنجاح

source: Ok
ar: موافق

source: Account
ar: الحساب

source: Change Password
ar: غير كلمة السر

# lang_theme
source: Language and Theme
ar: اللغة والمظهر

# privacy
source: Privacy and Security
ar: الخصوصية والأمن

# notification
source: Notifications
ar: إشعارات

source: New for you
ar: الجديد لك

source: SIGN OUT
ar: خروج

source: Edit profile
ar: تعديل الملف الشخصي

source: Age
ar: السن

# age_hint
source: Enter your age
ar: ادخل سنك
